PinguinoIDE/pinguino-compilers/windows32/p8/share/gputils/header/p18f97j94.inc
        LIST

;==========================================================================
; Build date : Aug 07 2014
;  MPASM PIC18F97J94 processor include
; 
;  (c) Copyright 1999-2014 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F97J94 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F97J94
;       2. LIST directive in the source file
;               LIST   P=PIC18F97J94
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F97J94
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0            EQU 0
FSR1            EQU 1
FSR2            EQU 2

FAST            EQU 1

W               EQU 0
A               EQU 0
ACCESS          EQU 0
BANKED          EQU 1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
UEP0             EQU  H'0DFF'
UEP1             EQU  H'0E00'
UEP2             EQU  H'0E01'
UEP3             EQU  H'0E02'
UEP4             EQU  H'0E03'
UEP5             EQU  H'0E04'
UEP6             EQU  H'0E05'
UEP7             EQU  H'0E06'
UEP8             EQU  H'0E07'
UEP9             EQU  H'0E08'
UEP10            EQU  H'0E09'
UEP11            EQU  H'0E0A'
UEP12            EQU  H'0E0B'
UEP13            EQU  H'0E0C'
UEP14            EQU  H'0E0D'
UEP15            EQU  H'0E0E'
UEIE             EQU  H'0E0F'
UIE              EQU  H'0E10'
UCFG             EQU  H'0E11'
RPOR0_1          EQU  H'0E12'
RPOR2_3          EQU  H'0E13'
RPOR4_5          EQU  H'0E14'
RPOR6_7          EQU  H'0E15'
RPOR8_9          EQU  H'0E16'
RPOR10_11        EQU  H'0E17'
RPOR12_13        EQU  H'0E18'
RPOR14_15        EQU  H'0E19'
RPOR16_17        EQU  H'0E1A'
RPOR18_19        EQU  H'0E1B'
RPOR20_21        EQU  H'0E1C'
RPOR22_23        EQU  H'0E1D'
RPOR24_25        EQU  H'0E1E'
RPOR26_27        EQU  H'0E1F'
RPOR28_29        EQU  H'0E20'
RPOR30_31        EQU  H'0E21'
RPOR32_33        EQU  H'0E22'
RPOR34_35        EQU  H'0E23'
RPOR36_37        EQU  H'0E24'
RPOR38_39        EQU  H'0E25'
RPOR40_41        EQU  H'0E26'
RPOR42_43        EQU  H'0E27'
RPOR44_45        EQU  H'0E28'
RPOR46           EQU  H'0E29'
RPINR0_1         EQU  H'0E2A'
RPINR2_3         EQU  H'0E2B'
RPINR4_5         EQU  H'0E2C'
RPINR6_7         EQU  H'0E2D'
RPINR8_9         EQU  H'0E2E'
RPINR10_11       EQU  H'0E2F'
RPINR12_13       EQU  H'0E30'
RPINR14_15       EQU  H'0E31'
RPINR16_17       EQU  H'0E32'
RPINR18_19       EQU  H'0E33'
RPINR20_21       EQU  H'0E34'
RPINR22_23       EQU  H'0E35'
RPINR24_25       EQU  H'0E36'
RPINR26_27       EQU  H'0E37'
RPINR28_29       EQU  H'0E38'
RPINR30_31       EQU  H'0E39'
RPINR32_33       EQU  H'0E3A'
RPINR34_35       EQU  H'0E3B'
RPINR36_37       EQU  H'0E3C'
RPINR38_39       EQU  H'0E3D'
RPINR40_41       EQU  H'0E3E'
RPINR42_43       EQU  H'0E3F'
RPINR44_45       EQU  H'0E40'
RPINR46_47       EQU  H'0E41'
RPINR48_49       EQU  H'0E42'
RPINR50_51       EQU  H'0E43'
RPINR52_53       EQU  H'0E44'
ANCON3           EQU  H'0E45'
ANCON2           EQU  H'0E46'
ANCON1           EQU  H'0E47'
ADCBUF1          EQU  H'0E48'
ADCBUF1L         EQU  H'0E48'
ADCBUF1H         EQU  H'0E49'
ADCBUF2          EQU  H'0E4A'
ADCBUF2L         EQU  H'0E4A'
ADCBUF2H         EQU  H'0E4B'
ADCBUF3          EQU  H'0E4C'
ADCBUF3L         EQU  H'0E4C'
ADCBUF3H         EQU  H'0E4D'
ADCBUF4          EQU  H'0E4E'
ADCBUF4L         EQU  H'0E4E'
ADCBUF4H         EQU  H'0E4F'
ADCBUF5          EQU  H'0E50'
ADCBUF5L         EQU  H'0E50'
ADCBUF5H         EQU  H'0E51'
ADCBUF6          EQU  H'0E52'
ADCBUF6L         EQU  H'0E52'
ADCBUF6H         EQU  H'0E53'
ADCBUF7          EQU  H'0E54'
ADCBUF7L         EQU  H'0E54'
ADCBUF7H         EQU  H'0E55'
ADCBUF8          EQU  H'0E56'
ADCBUF8L         EQU  H'0E56'
ADCBUF8H         EQU  H'0E57'
ADCBUF9          EQU  H'0E58'
ADCBUF9L         EQU  H'0E58'
ADCBUF9H         EQU  H'0E59'
ADCBUF10         EQU  H'0E5A'
ADCBUF10L        EQU  H'0E5A'
ADCBUF10H        EQU  H'0E5B'
ADCBUF11         EQU  H'0E5C'
ADCBUF11L        EQU  H'0E5C'
ADCBUF11H        EQU  H'0E5D'
ADCBUF12         EQU  H'0E5E'
ADCBUF12L        EQU  H'0E5E'
ADCBUF12H        EQU  H'0E5F'
ADCBUF13         EQU  H'0E60'
ADCBUF13L        EQU  H'0E60'
ADCBUF13H        EQU  H'0E61'
ADCBUF14         EQU  H'0E62'
ADCBUF14L        EQU  H'0E62'
ADCBUF14H        EQU  H'0E63'
ADCBUF15         EQU  H'0E64'
ADCBUF15L        EQU  H'0E64'
ADCBUF15H        EQU  H'0E65'
ADCBUF16         EQU  H'0E66'
ADCBUF16L        EQU  H'0E66'
ADCBUF16H        EQU  H'0E67'
ADCBUF17         EQU  H'0E68'
ADCBUF17L        EQU  H'0E68'
ADCBUF17H        EQU  H'0E69'
ADCBUF18         EQU  H'0E6A'
ADCBUF18L        EQU  H'0E6A'
ADCBUF18H        EQU  H'0E6B'
ADCBUF19         EQU  H'0E6C'
ADCBUF19L        EQU  H'0E6C'
ADCBUF19H        EQU  H'0E6D'
ADCBUF20         EQU  H'0E6E'
ADCBUF20L        EQU  H'0E6E'
ADCBUF20H        EQU  H'0E6F'
ADCBUF21         EQU  H'0E70'
ADCBUF21L        EQU  H'0E70'
ADCBUF21H        EQU  H'0E71'
ADCBUF22         EQU  H'0E72'
ADCBUF22L        EQU  H'0E72'
ADCBUF22H        EQU  H'0E73'
ADCBUF23         EQU  H'0E74'
ADCBUF23L        EQU  H'0E74'
ADCBUF23H        EQU  H'0E75'
ADCBUF24         EQU  H'0E76'
ADCBUF24L        EQU  H'0E76'
ADCBUF24H        EQU  H'0E77'
ADCBUF25         EQU  H'0E78'
ADCBUF25L        EQU  H'0E78'
ADCBUF25H        EQU  H'0E79'
ADCTMUEN0L       EQU  H'0E7A'
ADCTMUEN0H       EQU  H'0E7B'
ADCTMUEN1L       EQU  H'0E7C'
ADCTMUEN1H       EQU  H'0E7D'
ADCHIT0L         EQU  H'0E7E'
ADCHIT0H         EQU  H'0E7F'
ADCHIT1L         EQU  H'0E80'
ADCHIT1H         EQU  H'0E81'
ADCSS0L          EQU  H'0E82'
ADCSS0H          EQU  H'0E83'
ADCSS1L          EQU  H'0E84'
ADCSS1H          EQU  H'0E85'
ADCHS0L          EQU  H'0E86'
ADCHS0H          EQU  H'0E87'
ADCON5L          EQU  H'0E88'
ADCON5H          EQU  H'0E89'
ADCON3L          EQU  H'0E8A'
ADCON3H          EQU  H'0E8B'
ADCON2L          EQU  H'0E8C'
ADCON2H          EQU  H'0E8D'
LCDDATA0         EQU  H'0E8E'
LCDDATA1         EQU  H'0E8F'
LCDDATA2         EQU  H'0E90'
LCDDATA3         EQU  H'0E91'
LCDDATA4         EQU  H'0E92'
LCDDATA5         EQU  H'0E93'
LCDDATA6         EQU  H'0E94'
LCDDATA7         EQU  H'0E95'
LCDDATA8         EQU  H'0E96'
LCDDATA9         EQU  H'0E97'
LCDDATA10        EQU  H'0E98'
LCDDATA11        EQU  H'0E99'
LCDDATA12        EQU  H'0E9A'
LCDDATA13        EQU  H'0E9B'
LCDDATA14        EQU  H'0E9C'
LCDDATA15        EQU  H'0E9D'
LCDDATA16        EQU  H'0E9E'
LCDDATA17        EQU  H'0E9F'
LCDDATA18        EQU  H'0EA0'
LCDDATA19        EQU  H'0EA1'
LCDDATA20        EQU  H'0EA2'
LCDDATA21        EQU  H'0EA3'
LCDDATA22        EQU  H'0EA4'
LCDDATA23        EQU  H'0EA5'
LCDDATA24        EQU  H'0EA6'
LCDDATA25        EQU  H'0EA7'
LCDDATA26        EQU  H'0EA8'
LCDDATA27        EQU  H'0EA9'
LCDDATA28        EQU  H'0EAA'
LCDDATA29        EQU  H'0EAB'
LCDDATA30        EQU  H'0EAC'
LCDDATA31        EQU  H'0EAD'
LCDDATA32        EQU  H'0EAE'
LCDDATA33        EQU  H'0EAF'
LCDDATA34        EQU  H'0EB0'
LCDDATA35        EQU  H'0EB1'
LCDDATA36        EQU  H'0EB2'
LCDDATA37        EQU  H'0EB3'
LCDDATA38        EQU  H'0EB4'
LCDDATA39        EQU  H'0EB5'
LCDDATA40        EQU  H'0EB6'
LCDDATA41        EQU  H'0EB7'
LCDDATA42        EQU  H'0EB8'
LCDDATA43        EQU  H'0EB9'
LCDDATA44        EQU  H'0EBA'
LCDDATA45        EQU  H'0EBB'
LCDDATA46        EQU  H'0EBC'
LCDDATA47        EQU  H'0EBD'
LCDDATA48        EQU  H'0EBE'
LCDDATA49        EQU  H'0EBF'
LCDDATA50        EQU  H'0EC0'
LCDDATA51        EQU  H'0EC1'
LCDDATA52        EQU  H'0EC2'
LCDDATA53        EQU  H'0EC3'
LCDDATA54        EQU  H'0EC4'
LCDDATA55        EQU  H'0EC5'
LCDDATA56        EQU  H'0EC6'
LCDDATA57        EQU  H'0EC7'
LCDDATA58        EQU  H'0EC8'
LCDDATA59        EQU  H'0EC9'
LCDDATA60        EQU  H'0ECA'
LCDDATA61        EQU  H'0ECB'
LCDDATA62        EQU  H'0ECC'
LCDDATA63        EQU  H'0ECD'
LCDSE0           EQU  H'0ECE'
LCDSE1           EQU  H'0ECF'
LCDSE2           EQU  H'0ED0'
LCDSE3           EQU  H'0ED1'
LCDSE4           EQU  H'0ED2'
LCDSE5           EQU  H'0ED3'
LCDSE6           EQU  H'0ED4'
LCDSE7           EQU  H'0ED5'
LCDRL            EQU  H'0ED6'
LCDREF           EQU  H'0ED7'
LCDREG           EQU  H'0ED8'
LCDCON           EQU  H'0ED9'
LCDPS            EQU  H'0EDA'
REFO2CON3        EQU  H'0EDB'
REFO2CON2        EQU  H'0EDC'
REFO2CON1        EQU  H'0EDD'
REFO2CON         EQU  H'0EDE'
REFO1CON3        EQU  H'0EDF'
REFO1CON2        EQU  H'0EE0'
REFO1CON1        EQU  H'0EE1'
REFO1CON         EQU  H'0EE2'
MEMCON           EQU  H'0EE3'
PORTL            EQU  H'0EE4'
LATL             EQU  H'0EE5'
TRISL            EQU  H'0EE6'
PORTK            EQU  H'0EE7'
LATK             EQU  H'0EE8'
TRISK            EQU  H'0EE9'
ODCON2           EQU  H'0EEA'
ODCON1           EQU  H'0EEB'
MDCARL           EQU  H'0EEC'
MDCARH           EQU  H'0EED'
MDSRC            EQU  H'0EEE'
MDCON            EQU  H'0EEF'
PMD4             EQU  H'0EF0'
PMD3             EQU  H'0EF1'
PMD2             EQU  H'0EF2'
PMD1             EQU  H'0EF3'
PMD0             EQU  H'0EF4'
CTMUCON4         EQU  H'0EF5'
CTMUCON3         EQU  H'0EF6'
CTMUCON2         EQU  H'0EF7'
CTMUCON1         EQU  H'0EF8'
TXREG4           EQU  H'0EF9'
RCREG4           EQU  H'0EFA'
SPBRG4           EQU  H'0EFB'
SPBRGH4          EQU  H'0EFC'
BAUDCON4         EQU  H'0EFD'
TXSTA4           EQU  H'0EFE'
RCSTA4           EQU  H'0EFF'
DMACON2          EQU  H'0F00'
ANCFG            EQU  H'0F01'
SSP2ADD          EQU  H'0F02'
SSP2BUF          EQU  H'0F03'
T4CON            EQU  H'0F04'
PR4              EQU  H'0F05'
TMR4             EQU  H'0F06'
CCP7CON          EQU  H'0F07'
CCPR7            EQU  H'0F08'
CCPR7L           EQU  H'0F08'
CCPR7H           EQU  H'0F09'
CCP6CON          EQU  H'0F0A'
CCPR6            EQU  H'0F0B'
CCPR6L           EQU  H'0F0B'
CCPR6H           EQU  H'0F0C'
CCP5CON          EQU  H'0F0D'
CCPR5            EQU  H'0F0E'
CCPR5L           EQU  H'0F0E'
CCPR5H           EQU  H'0F0F'
CCP4CON          EQU  H'0F10'
CCPR4            EQU  H'0F11'
CCPR4L           EQU  H'0F11'
CCPR4H           EQU  H'0F12'
T5GCON           EQU  H'0F13'
T5CON            EQU  H'0F14'
TMR5             EQU  H'0F15'
TMR5L            EQU  H'0F15'
TMR5H            EQU  H'0F16'
SSP2MSK          EQU  H'0F17'
SSP2CON2         EQU  H'0F18'
SSP2CON1         EQU  H'0F19'
SSP2STAT         EQU  H'0F1A'
PSTR3CON         EQU  H'0F1B'
PSTR2CON         EQU  H'0F1C'
TXREG2           EQU  H'0F1D'
RCREG2           EQU  H'0F1E'
SPBRG2           EQU  H'0F1F'
SPBRGH2          EQU  H'0F20'
DSGPR3           EQU  H'0F21'
DSGPR2           EQU  H'0F22'
DSGPR1           EQU  H'0F23'
DSGPR0           EQU  H'0F24'
DSWAKEH          EQU  H'0F25'
DSWAKEL          EQU  H'0F26'
DSCONH           EQU  H'0F27'
DSCONL           EQU  H'0F28'
TXREG3           EQU  H'0F29'
RCREG3           EQU  H'0F2A'
SPBRG3           EQU  H'0F2B'
SPBRGH3          EQU  H'0F2C'
BAUDCON3         EQU  H'0F2D'
TXSTA3           EQU  H'0F2E'
RCSTA3           EQU  H'0F2F'
SPBRGH           EQU  H'0F30'
SPBRGH1          EQU  H'0F30'
BAUDCON2         EQU  H'0F31'
TXSTA2           EQU  H'0F32'
RCSTA2           EQU  H'0F33'
CCPTMRS2         EQU  H'0F34'
CCPTMRS1         EQU  H'0F35'
CCPTMRS0         EQU  H'0F36'
CM3CON           EQU  H'0F37'
CM2CON           EQU  H'0F38'
SSP2CON3         EQU  H'0F39'
T8CON            EQU  H'0F3A'
PR8              EQU  H'0F3B'
TMR8             EQU  H'0F3C'
T6CON            EQU  H'0F3D'
PR6              EQU  H'0F3E'
TMR6             EQU  H'0F3F'
CCP10CON         EQU  H'0F40'
CCPR10           EQU  H'0F41'
CCPR10L          EQU  H'0F41'
CCPR10H          EQU  H'0F42'
CCP9CON          EQU  H'0F43'
CCPR9            EQU  H'0F44'
CCPR9L           EQU  H'0F44'
CCPR9H           EQU  H'0F45'
CCP8CON          EQU  H'0F46'
CCPR8            EQU  H'0F47'
CCPR8L           EQU  H'0F47'
CCPR8H           EQU  H'0F48'
CCP3CON          EQU  H'0F49'
CCPR3            EQU  H'0F4A'
CCPR3L           EQU  H'0F4A'
CCPR3H           EQU  H'0F4B'
ECCP3DEL         EQU  H'0F4C'
ECCP3AS          EQU  H'0F4D'
CCP2CON          EQU  H'0F4E'
CCPR2            EQU  H'0F4F'
CCPR2L           EQU  H'0F4F'
CCPR2H           EQU  H'0F50'
ECCP2DEL         EQU  H'0F51'
ECCP2AS          EQU  H'0F52'
CM1CON           EQU  H'0F53'
PADCFG1          EQU  H'0F54'
IOCN             EQU  H'0F55'
IOCP             EQU  H'0F56'
RTCCON2          EQU  H'0F57'
ALRMVALL         EQU  H'0F58'
ALRMVALH         EQU  H'0F59'
ALRMRPT          EQU  H'0F5A'
ALRMCFG          EQU  H'0F5B'
RTCVALL          EQU  H'0F5C'
RTCVALH          EQU  H'0F5D'
RTCCAL           EQU  H'0F5E'
RTCCON1          EQU  H'0F5F'
DMACON1          EQU  H'0F60'
PIE6             EQU  H'0F61'
WPUB             EQU  H'0F62'
ACTCON           EQU  H'0F63'
OSCCON4          EQU  H'0F64'
OSCCON3          EQU  H'0F65'
OSCCON2          EQU  H'0F66'
BAUDCON          EQU  H'0F67'
BAUDCON1         EQU  H'0F67'
SSP1MSK          EQU  H'0F68'
SSP1CON3         EQU  H'0F69'
TXBUF            EQU  H'0F6A'
DMABCH           EQU  H'0F6B'
DMABCL           EQU  H'0F6C'
RXADDRH          EQU  H'0F6D'
RXADDRL          EQU  H'0F6E'
TXADDRH          EQU  H'0F6F'
TXADDRL          EQU  H'0F70'
PORTVP           EQU  H'0F71'
LATVP            EQU  H'0F72'
TRISVP           EQU  H'0F73'
UADDR            EQU  H'0F74'
UCON             EQU  H'0F75'
USTAT            EQU  H'0F76'
UEIR             EQU  H'0F77'
UIR              EQU  H'0F78'
UFRM             EQU  H'0F79'
UFRMH            EQU  H'0F79'
UFRML            EQU  H'0F7A'
RCON4            EQU  H'0F7B'
RCON3            EQU  H'0F7C'
RCON2            EQU  H'0F7D'
EECON2           EQU  H'0F7E'
EECON1           EQU  H'0F7F'
PORTA            EQU  H'0F80'
PORTB            EQU  H'0F81'
PORTC            EQU  H'0F82'
PORTD            EQU  H'0F83'
PORTE            EQU  H'0F84'
PORTF            EQU  H'0F85'
PORTG            EQU  H'0F86'
PORTH            EQU  H'0F87'
PORTJ            EQU  H'0F88'
LATA             EQU  H'0F89'
LATB             EQU  H'0F8A'
LATC             EQU  H'0F8B'
LATD             EQU  H'0F8C'
LATE             EQU  H'0F8D'
LATF             EQU  H'0F8E'
LATG             EQU  H'0F8F'
LATH             EQU  H'0F90'
LATJ             EQU  H'0F91'
TRISA            EQU  H'0F92'
TRISB            EQU  H'0F93'
TRISC            EQU  H'0F94'
TRISD            EQU  H'0F95'
TRISE            EQU  H'0F96'
TRISF            EQU  H'0F97'
TRISG            EQU  H'0F98'
TRISH            EQU  H'0F99'
TRISJ            EQU  H'0F9A'
OSCTUNE          EQU  H'0F9B'
PSTR1CON         EQU  H'0F9C'
PIE1             EQU  H'0F9D'
PIR1             EQU  H'0F9E'
IPR1             EQU  H'0F9F'
PIE2             EQU  H'0FA0'
PIR2             EQU  H'0FA1'
IPR2             EQU  H'0FA2'
PIE3             EQU  H'0FA3'
PIR3             EQU  H'0FA4'
IPR3             EQU  H'0FA5'
PIR6             EQU  H'0FA6'
PSPCON           EQU  H'0FA7'
HLVDCON          EQU  H'0FA8'
IPR6             EQU  H'0FA9'
T1GCON           EQU  H'0FAA'
RCSTA            EQU  H'0FAB'
RCSTA1           EQU  H'0FAB'
TXSTA            EQU  H'0FAC'
TXSTA1           EQU  H'0FAC'
TXREG            EQU  H'0FAD'
TXREG1           EQU  H'0FAD'
RCREG            EQU  H'0FAE'
RCREG1           EQU  H'0FAE'
SPBRG            EQU  H'0FAF'
SPBRG1           EQU  H'0FAF'
T3GCON           EQU  H'0FB0'
T3CON            EQU  H'0FB1'
TMR3             EQU  H'0FB2'
TMR3L            EQU  H'0FB2'
TMR3H            EQU  H'0FB3'
PIE4             EQU  H'0FB4'
PIR4             EQU  H'0FB5'
IPR4             EQU  H'0FB6'
PIE5             EQU  H'0FB7'
PIR5             EQU  H'0FB8'
CCP1CON          EQU  H'0FB9'
CCPR1            EQU  H'0FBA'
CCPR1L           EQU  H'0FBA'
CCPR1H           EQU  H'0FBB'
ECCP1DEL         EQU  H'0FBC'
ECCP1AS          EQU  H'0FBD'
CVRCONL          EQU  H'0FBE'
CVRCONH          EQU  H'0FBF'
ADCON1L          EQU  H'0FC0'
ADCON1H          EQU  H'0FC1'
ADCBUF0          EQU  H'0FC2'
ADCBUF0L         EQU  H'0FC2'
ADCBUF0H         EQU  H'0FC3'
CMSTAT           EQU  H'0FC4'
SSP1CON2         EQU  H'0FC5'
SSP1CON1         EQU  H'0FC6'
SSP1STAT         EQU  H'0FC7'
SSP1ADD          EQU  H'0FC8'
SSP1BUF          EQU  H'0FC9'
T2CON            EQU  H'0FCA'
PR2              EQU  H'0FCB'
TMR2             EQU  H'0FCC'
T1CON            EQU  H'0FCD'
TMR1             EQU  H'0FCE'
TMR1L            EQU  H'0FCE'
TMR1H            EQU  H'0FCF'
RCON             EQU  H'0FD0'
IOCF             EQU  H'0FD1'
IPR5             EQU  H'0FD2'
OSCCON           EQU  H'0FD3'
T0CON            EQU  H'0FD5'
TMR0             EQU  H'0FD6'
TMR0L            EQU  H'0FD6'
TMR0H            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON3          EQU  H'0FF0'
INTCON2          EQU  H'0FF1'
INTCON           EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- UEP0 Bits -----------------------------------------------------
EPSTALL          EQU  H'0000'
EPINEN           EQU  H'0001'
EPOUTEN          EQU  H'0002'
EPCONDIS         EQU  H'0003'
EPHSHK           EQU  H'0004'


